Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer
The Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer interfaces the graphics drawer.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.Clear
Removes all graphics drawn by the current graphics from the views.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawArc(Tekla.Structures.Geometry3d.Arc,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the curve of the given arc to the views.
arc: The Tekla.Structures.Geometry3d.Arc defining the graphic.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawCircle(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the circle to the views.
center: The center.
normal: The normal of the circle.
radius: The radius of the circle.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawLine(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the line with the given startPoint and endPoint.
startPoint: The start point.
endPoint: The end point.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawLines(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.LineSegment},Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the given polyline.
polyline: The polyline.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawDimension(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Plugins.DirectManipulation.Services.DimensionEndPointSizeType)
Draws a dimension line with direction arrows.
line: The line to define the dimension line.
graphicNormal: The normal to define the arrow orientation.
sizeType: Type of the size of the dimension arrows.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawFace(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Plugins.DirectManipulation.Services.SurfaceType,System.Boolean)
Draws the mesh composed of the given contourPoints.
contourPoints: The contour points.
surfaceType: Type of the surface.
doubleSided: A value indicating whether the mesh is double-sided.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawText(System.String,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.TextRepresentationTypes)
Draws the given text at the location.
text: The text.
location: The location.
textTypes: Type of the text.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawProfile(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the specified profile at the given direction.
profile: The profile.
direction: The direction.
offsetVector: A vector, that defines the offset of the drawn object from the relative origin.
rotationInDegrees: The rotation angle around the direction in degrees.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawShape(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the specified shape at the given direction.
shape: The shape.
direction: The direction.
offsetVector: A vector, that defines the offset of the drawn object from the relative origin.
rotationInDegrees: The rotation angle around the direction in degrees.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawCustomPart(System.String,Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the specified customPart at the given direction.
customPart: The custom part.
direction: The direction.
offsetVector: A vector, that defines the offset of the drawn object from the relative origin.
rotationInDegrees: The rotation angle around the direction in degrees.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawExtrema(Tekla.Structures.Geometry3d.AABB,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws the specified extrema.
extrema: The extrema.
lineType: Type of the curve.

Tekla.Structures.Plugins.DirectManipulation.Core.IGraphicsDrawer.DrawExtrema(Tekla.Structures.Geometry3d.LineSegment,System.Double,System.Double,Tekla.Structures.Geometry3d.Vector,System.Double,Tekla.Structures.Plugins.DirectManipulation.Services.LineType)
Draws an extrema box with given width, height and direction.
direction: The direction.
width: The width.
height: The height.
offsetVector: A vector, that defines the offset of the drawn object from the relative origin.
rotationInDegrees: The rotation angle around the direction in degrees.
lineType: Type of the curve.